# Introducción a Pandas

[*Pandas*](http://pandas.pydata.org/) Es una librería de python para análisis de datos estructuradas en columnas y renglones, muy popular para manipulación, análisis y preprocesamiento  en columnas, ideal para manipular y analizar datos de entrada. Además, *Pandas* se integra muy bien con otras librerías de Ciencia de Datos, de manera que usualmente los algoritmos de machine learning reciben como entradas las dos principales estructuras de *Pandas*: los `DataFrames` y las `Series`

In [1]:
# Importar librería
import pandas as pd
import numpy as np

# Objetos de Pandas

In [2]:
import numpy as np
import pandas as pd

## Series

equivalente a un vector de pandas, puede crearse desde una lista o un vector

In [3]:
c = ['rojo', 'verde', 'azul', 'amarillo']
colores = pd.Series(c)
colores

0        rojo
1       verde
2        azul
3    amarillo
dtype: object

In [4]:
p = np.array([0.2, 0.4, 0.8, 1])
porcentajes = pd.Series(p)
porcentajes

0    0.2
1    0.4
2    0.8
3    1.0
dtype: float64

Una serie consta de los valores y de los índices y se puede acceder a ellos con los atributos  ``values`` e ``index``.

Los valores son un vector de NumPy

In [5]:
porcentajes.values

array([0.2, 0.4, 0.8, 1. ])

In [6]:
porcentajes.index

RangeIndex(start=0, stop=4, step=1)

Como en un vector de numpy, usamos los indices par obtener un subconjunto de elementos.

In [7]:
porcentajes[1]

0.4

In [8]:
porcentajes[1:3]

1    0.4
2    0.8
dtype: float64

Los objetos ``Series`` tienen la ventaja sobre los vectores de numpy que permite definir indices asociados a los valores, y pueden ser de cualquier tipo por ejemplo:

In [9]:
nivel_color = pd.Series(p,
                 index=c)
nivel_color

rojo        0.2
verde       0.4
azul        0.8
amarillo    1.0
dtype: float64

In [10]:
nivel_color['azul']

0.8

### Series son también como diccionarios

In [11]:
#diccionario con la población en 2010 para estados seleccionados

poblacion_dict = {'Aguascalientes': 608358	,
                   'Guanajuato': 5486372,
                   'Jalisco': 7396986,
                   'CDMX': 8851080,
                   'Querétaro': 1827937}

pob = pd.Series(poblacion_dict)
pob

Aguascalientes     608358
Guanajuato        5486372
Jalisco           7396986
CDMX              8851080
Querétaro         1827937
dtype: int64

In [12]:
pob['Querétaro']

1827937

Con la ventaja de que podemos seleccionar una parte de los datos

In [14]:
pob['Aguascalientes':'CDMX']

Aguascalientes     608358
Guanajuato        5486372
Jalisco           7396986
CDMX              8851080
dtype: int64

### Más ejemplos de series

In [15]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [16]:
pd.Series(14, index=[150, 220, 380])

150    14
220    14
380    14
dtype: int64

In [17]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

##  DataFrame 

Igual que las ```Series```, un ```DataFrame``` se puede entender como una matriz de numpy o como un diccionario, con ventajas adicionales

In [18]:
hombres = {'Aguascalientes': 576638	,  'Guanajuato': 2639425,
           'Jalisco':3600641 , 'CDMX': 4233783, 'Querétaro': 887188	}
pob_h = pd.Series(hombres)
pob_h

Aguascalientes     576638
Guanajuato        2639425
Jalisco           3600641
CDMX              4233783
Querétaro          887188
dtype: int64

In [19]:
pob

Aguascalientes     608358
Guanajuato        5486372
Jalisco           7396986
CDMX              8851080
Querétaro         1827937
dtype: int64

In [20]:
#usamos un nuevo diccionario con dos series, qué comparten indice para crear un solo objeto con esta información 
poblacion = pd.DataFrame({'total': pob,'hombres': pob_h})
poblacion

                  total  hombres
Aguascalientes   608358   576638
Guanajuato      5486372  2639425
Jalisco         7396986  3600641
CDMX            8851080  4233783
Querétaro       1827937   887188

In [ ]:
pob.index

Index(['Aguascalientes', 'Guanajuato', 'Jalisco', 'CDMX', 'Querétaro'], dtype='object')

Un  ``DataFrame`` tiene además del atributo ``columns`` que es un índice que contiene las etiquetas de cada columna.

In [ ]:
poblacion.columns

Index(['total', 'hombres'], dtype='object')

Los DataFrame son también una especie de diccionario donde las columnas actuan como claves

In [ ]:
poblacion['hombres']

Aguascalientes     576638
Guanajuato        2639425
Jalisco           3600641
CDMX              4233783
Querétaro          887188
Name: hombres, dtype: int64

al igual que los diccionarios, podemos agregar nuevas claves , y al igual que en numpy podemos hacer opercion de vectores sin necesidad de recurrir a ciclos for

In [22]:
poblacion['mujeres'] = poblacion['total'] - poblacion['hombres']
poblacion

                  total  hombres  mujeres
Aguascalientes   608358   576638    31720
Guanajuato      5486372  2639425  2846947
Jalisco         7396986  3600641  3796345
CDMX            8851080  4233783  4617297
Querétaro       1827937   887188   940749

### Creación de diccionarios a partir de distintos objetos

#### Desde una o varias series

In [ ]:
pd.DataFrame(pob_h, columns=['poblacion_hombres'])

                poblacion_hombres
Aguascalientes             576638
Guanajuato                2639425
Jalisco                   3600641
CDMX                      4233783
Querétaro                  887188

#### Desde una diccionario

In [ ]:
dimensiones = [{'longitud': i, 'área': i*i}
        for i in range(5)]
pd.DataFrame(dimensiones)

   longitud  área
0         0     0
1         1     1
2         2     4
3         3     9
4         4    16

#### Desde una matriz de NumPy

In [ ]:
pd.DataFrame(np.random.rand(5, 3),
             columns=['columna1', 'columna2','columna3'],
             index=['a', 'b', 'c', 'd', 'e'])

   columna1  columna2  columna3
a  0.815046  0.828736  0.466879
b  0.122835  0.229463  0.483728
c  0.807888  0.999082  0.541946
d  0.413675  0.853019  0.120638
e  0.465486  0.701128  0.744407

## Lectura de archivos csv como DataFrames

In [23]:
#Leer datos mediante la función csv

titanic = pd.read_csv("https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv")
type(titanic)

pandas.core.frame.DataFrame

In [24]:
titanic

     Survived  Pclass  ... Parents/Children Aboard     Fare
0           0       3  ...                       0   7.2500
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
4           0       3  ...                       0   8.0500
..        ...     ...  ...                     ...      ...
882         0       2  ...                       0  13.0000
883         1       1  ...                       0  30.0000
884         0       3  ...                       2  23.4500
885         1       1  ...                       0  30.0000
886         0       3  ...                       0   7.7500

[887 rows x 8 columns]

In [25]:
titanic = titanic.set_index("Name")
titanic.head()

                                                    Survived  ...     Fare
Name                                                          ...
Mr. Owen Harris Braund                                     0  ...   7.2500
Mrs. John Bradley (Florence Briggs Thayer) Cumings         1  ...  71.2833
Miss. Laina Heikkinen                                      1  ...   7.9250
Mrs. Jacques Heath (Lily May Peel) Futrelle                1  ...  53.1000
Mr. William Henry Allen                                    0  ...   8.0500

[5 rows x 7 columns]

In [26]:
print(titanic.columns)

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

In [27]:
print(titanic.index)

Index(['Mr. Owen Harris Braund',
       'Mrs. John Bradley (Florence Briggs Thayer) Cumings',
       'Miss. Laina Heikkinen', 'Mrs. Jacques Heath (Lily May Peel) Futrelle',
       'Mr. William Henry Allen', 'Mr. James Moran', 'Mr. Timothy J McCarthy',
       'Master. Gosta Leonard Palsson',
       'Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson',
       'Mrs. Nicholas (Adele Achem) Nasser',
       ...
       'Mr. Johann Markun', 'Miss. Gerda Ulrika Dahlberg',
       'Mr. Frederick James Banfield', 'Mr. Henry Jr Sutehall',
       'Mrs. William (Margaret Norton) Rice', 'Rev. Juozas Montvila',
       'Miss. Margaret Edith Graham', 'Miss. Catherine Helen Johnston',
       'Mr. Karl Howell Behr', 'Mr. Patrick Dooley'],
      dtype='object', name='Name', length=887)

In [28]:
## Una sola columna del datafreme la podemos usar como una Serie

edad = titanic['Age']
type(edad)

pandas.core.series.Series

In [29]:
edad

Name
Mr. Owen Harris Braund                                22.0
Mrs. John Bradley (Florence Briggs Thayer) Cumings    38.0
Miss. Laina Heikkinen                                 26.0
Mrs. Jacques Heath (Lily May Peel) Futrelle           35.0
Mr. William Henry Allen                               35.0
                                                      ...
Rev. Juozas Montvila                                  27.0
Miss. Margaret Edith Graham                           19.0
Miss. Catherine Helen Johnston                         7.0
Mr. Karl Howell Behr                                  26.0
Mr. Patrick Dooley                                    32.0
Name: Age, Length: 887, dtype: float64

### Funciones, métodos y atributos .

In [ ]:
titanic.info()  #regresa el numero de renglones, el número de columnas, los nombres de las columnas, 
                #la cantidad de datos faltanes, la clase de cada variable

<class 'pandas.core.frame.DataFrame'>
Index: 887 entries, Mr. Owen Harris Braund to Mr. Patrick Dooley
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Sex                      887 non-null    object
 3   Age                      887 non-null    float64
 4   Siblings/Spouses Aboard  887 non-null    int64
 5   Parents/Children Aboard  887 non-null    int64
 6   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(1)
memory usage: 95.4+ KB

In [31]:
titanic.describe(include='all')

          Survived      Pclass  ... Parents/Children Aboard       Fare
count   887.000000  887.000000  ...              887.000000  887.00000
unique         NaN         NaN  ...                     NaN        NaN
top            NaN         NaN  ...                     NaN        NaN
freq           NaN         NaN  ...                     NaN        NaN
mean      0.385569    2.305524  ...                0.383315   32.30542
std       0.487004    0.836662  ...                0.807466   49.78204
min       0.000000    1.000000  ...                0.000000    0.00000
25%       0.000000    2.000000  ...                0.000000    7.92500
50%       0.000000    3.000000  ...                0.000000   14.45420
75%       1.000000    3.000000  ...                0.000000   31.13750
max       1.000000    3.000000  ...                6.000000  512.32920

[11 rows x 7 columns]

In [32]:
#ver la cantidad de renglones y de columnas utilizando el atributo shape
print('dimensiones: ', titanic.shape)
print('\nrenglones: ', titanic.shape[0])
print('columnas:  ', titanic.shape[1])

dimensiones:  (887, 7)

renglones:  887
columnas:   7

In [33]:
type(titanic.shape)

tuple

In [34]:
#regresa el número de valores en cada variable 
titanic.nunique()

Survived                     2
Pclass                       3
Sex                          2
Age                         89
Siblings/Spouses Aboard      7
Parents/Children Aboard      7
Fare                       248
dtype: int64

In [35]:
titanic.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

In [36]:
for column in titanic.columns:
    print(titanic[column].value_counts(),'\n')   
    
# value_counts() es un método para Series, pero no para DataFrames, 
# por eso iteramos por cada una de las columnas

0    545
1    342
Name: Survived, dtype: int64

3    487
1    216
2    184
Name: Pclass, dtype: int64

male      573
female    314
Name: Sex, dtype: int64

22.00    39
28.00    37
18.00    36
21.00    34
24.00    34
         ..
70.50     1
36.50     1
23.50     1
55.50     1
0.42      1
Name: Age, Length: 89, dtype: int64

0    604
1    209
2     28
4     18
3     16
8      7
5      5
Name: Siblings/Spouses Aboard, dtype: int64

0    674
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parents/Children Aboard, dtype: int64

8.0500     43
13.0000    42
7.8958     36
7.7500     33
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

### Métodos para resumir en un solo valor información

Producen un único valor relacionado con los datos a los que se aplica. Si no se especifica otra cosa se Pandas lo aplica resumiendo los valores de cada columna de un dataframe, si se quiere resumir las variables de cada renglón, se deberá especificar axis=1 entre los paréntesis.

Algunos de ellos son:
![image.png](attachment:image.png)

In [ ]:
titanic.mean()

Survived                    0.385569
Pclass                      2.305524
Age                        29.471443
Siblings/Spouses Aboard     0.525366
Parents/Children Aboard     0.383315
Fare                       32.305420
dtype: float64

In [ ]:
titanic.count()

Survived                   887
Pclass                     887
Sex                        887
Age                        887
Siblings/Spouses Aboard    887
Parents/Children Aboard    887
Fare                       887
dtype: int64

In [37]:
titanic.isnull()

Survived                   0
Pclass                     0
Sex                        0
Age                        0
Siblings/Spouses Aboard    0
Parents/Children Aboard    0
Fare                       0
dtype: int64

In [39]:
print(titanic.isnull().sum())

Survived                   0
Pclass                     0
Sex                        0
Age                        0
Siblings/Spouses Aboard    0
Parents/Children Aboard    0
Fare                       0
dtype: int64

In [40]:
print('\n',titanic.isnull().sum(axis=1))

 Name
Mr. Owen Harris Braund                                0
Mrs. John Bradley (Florence Briggs Thayer) Cumings    0
Miss. Laina Heikkinen                                 0
Mrs. Jacques Heath (Lily May Peel) Futrelle           0
Mr. William Henry Allen                               0
                                                     ..
Rev. Juozas Montvila                                  0
Miss. Margaret Edith Graham                           0
Miss. Catherine Helen Johnston                        0
Mr. Karl Howell Behr                                  0
Mr. Patrick Dooley                                    0
Length: 887, dtype: int64

### Acceso a los datos usando etiquetas o posiciones

In [ ]:
titanic.tail(3)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Miss. Catherine Helen Johnston,0,3,female,7.0,1,2,23.45
Mr. Karl Howell Behr,1,1,male,26.0,0,0,30.00
Mr. Patrick Dooley,0,3,male,32.0,0,0,7.75

Acceso a los datos utilizando etiquetas de las columnas

Las siguientes expresiones son equivalentes:
- titanic['Age'] 
- titanic.Age

In [ ]:
titanic['Age']

Name
Mr. Owen Harris Braund                                22.0
Mrs. John Bradley (Florence Briggs Thayer) Cumings    38.0
Miss. Laina Heikkinen                                 26.0
Mrs. Jacques Heath (Lily May Peel) Futrelle           35.0
Mr. William Henry Allen                               35.0
                                                      ...
Rev. Juozas Montvila                                  27.0
Miss. Margaret Edith Graham                           19.0
Miss. Catherine Helen Johnston                         7.0
Mr. Karl Howell Behr                                  26.0
Mr. Patrick Dooley                                    32.0
Name: Age, Length: 887, dtype: float64

In [ ]:
titanic[['Age', 'Survived']]

                                                     Age  Survived
Name
Mr. Owen Harris Braund                              22.0         0
Mrs. John Bradley (Florence Briggs Thayer) Cumings  38.0         1
Miss. Laina Heikkinen                               26.0         1
Mrs. Jacques Heath (Lily May Peel) Futrelle         35.0         1
Mr. William Henry Allen                             35.0         0
...                                                  ...       ...
Rev. Juozas Montvila                                27.0         0
Miss. Margaret Edith Graham                         19.0         1
Miss. Catherine Helen Johnston                       7.0         0
Mr. Karl Howell Behr                                26.0         1
Mr. Patrick Dooley                                  32.0         0

[887 rows x 2 columns]

In [ ]:
titanic.head(6)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Mr. Owen Harris Braund,0,3,male,22.0,1,0,7.2500
Mrs. John Bradley (Florence Briggs Thayer) Cumings,1,1,female,38.0,1,0,71.2833
Miss. Laina Heikkinen,1,3,female,26.0,0,0,7.9250
Mrs. Jacques Heath (Lily May Peel) Futrelle,1,1,female,35.0,1,0,53.1000
Mr. William Henry Allen,0,3,male,35.0,0,0,8.0500
Mr. James Moran,0,3,male,27.0,0,0,8.4583

In [ ]:
titanic.loc['Miss. Laina Heikkinen':'Mr. William Henry Allen']

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Miss. Laina Heikkinen,1,3,female,26.0,0,0,7.925
Mrs. Jacques Heath (Lily May Peel) Futrelle,1,1,female,35.0,1,0,53.100
Mr. William Henry Allen,0,3,male,35.0,0,0,8.050

In [ ]:
titanic.loc['Miss. Laina Heikkinen':'Mr. William Henry Allen', 'Survived':'Age']

                                             Survived  Pclass     Sex   Age
Name
Miss. Laina Heikkinen                               1       3  female  26.0
Mrs. Jacques Heath (Lily May Peel) Futrelle         1       1  female  35.0
Mr. William Henry Allen                             0       3    male  35.0

In [ ]:
titanic.loc[:,'Age']

Name
Mr. Owen Harris Braund                                22.0
Mrs. John Bradley (Florence Briggs Thayer) Cumings    38.0
Miss. Laina Heikkinen                                 26.0
Mrs. Jacques Heath (Lily May Peel) Futrelle           35.0
Mr. William Henry Allen                               35.0
                                                      ...
Rev. Juozas Montvila                                  27.0
Miss. Margaret Edith Graham                           19.0
Miss. Catherine Helen Johnston                         7.0
Mr. Karl Howell Behr                                  26.0
Mr. Patrick Dooley                                    32.0
Name: Age, Length: 887, dtype: float64

Se utiliza df.iloc[row, column], para  usar las posiciones de un valor

In [ ]:
titanic.iloc[4:6,3]

Name
Mr. William Henry Allen    35.0
Mr. James Moran            27.0
Name: Age, dtype: float64

## Filtrado de datos

In [ ]:
filtro = titanic['Pclass']==3

tercera = titanic[filtro]
tercera.head(10)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Mr. Owen Harris Braund,0,3,male,22.0,1,0,7.2500
Miss. Laina Heikkinen,1,3,female,26.0,0,0,7.9250
Mr. William Henry Allen,0,3,male,35.0,0,0,8.0500
Mr. James Moran,0,3,male,27.0,0,0,8.4583
Master. Gosta Leonard Palsson,0,3,male,2.0,3,1,21.0750
Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,1,3,female,27.0,0,2,11.1333
Miss. Marguerite Rut Sandstrom,1,3,female,4.0,1,1,16.7000
Mr. William Henry Saundercock,0,3,male,20.0,0,0,8.0500
Mr. Anders Johan Andersson,0,3,male,39.0,1,5,31.2750
Miss. Hulda Amanda Adolfina Vestrom,0,3,female,14.0,0,0,7.8542

In [ ]:
#Guarda el conjunto de datos que cumple la condición 
menores10anios = titanic[titanic['Age']<10]   
print(menores10anios.shape)
menores10anios.head()

(71, 7)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Master. Gosta Leonard Palsson,0,3,male,2.0,3,1,21.0750
Miss. Marguerite Rut Sandstrom,1,3,female,4.0,1,1,16.7000
Master. Eugene Rice,0,3,male,2.0,4,1,29.1250
Miss. Torborg Danira Palsson,0,3,female,8.0,3,1,21.0750
Miss. Simonne Marie Anne Andree Laroche,1,2,female,3.0,1,2,41.5792

In [ ]:
hombres = titanic[titanic['Sex']=='male']
print(hombres.shape)
hombres.tail()

(573, 7)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Mr. Frederick James Banfield,0,2,male,28.0,0,0,10.50
Mr. Henry Jr Sutehall,0,3,male,25.0,0,0,7.05
Rev. Juozas Montvila,0,2,male,27.0,0,0,13.00
Mr. Karl Howell Behr,1,1,male,26.0,0,0,30.00
Mr. Patrick Dooley,0,3,male,32.0,0,0,7.75

In [ ]:
#Subconjunto de pasajeros de primera clase mujeres
filtro1 = titanic['Pclass']==1
filtro2 = titanic['Sex']=='female'

MujeresPrimera=titanic[filtro1 & filtro2]

print(MujeresPrimera.shape)
MujeresPrimera.head()

(94, 7)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
Name,,,,,,,
Mrs. John Bradley (Florence Briggs Thayer) Cumings,1,1,female,38.0,1,0,71.2833
Mrs. Jacques Heath (Lily May Peel) Futrelle,1,1,female,35.0,1,0,53.1000
Miss. Elizabeth Bonnell,1,1,female,58.0,0,0,26.5500
Mrs. William Augustus (Marie Eugenie) Spencer,1,1,female,48.0,1,0,146.5208
Mrs. Henry Sleeper (Myna Haxtun) Harper,1,1,female,49.0,1,0,76.7292

## Recomendacion para programadores que inician su práctica.


1. Escribe y ejecuta una sola linea de codigo para explorar tus datos
2. Verifica su correcto funcionamiento, obteniendo el output de esa linea
3. Asigna el resultad a una variable
4. En la misma linea, muestra las primeras lineas del Data Frame o la Serie, según la acción ejecutada.
5. Continua en la siguiente celda.